aide
burpsuite
c-client
girara-git
google-chrome
lastpass-cli
otf-space-grotesk
outlook-for-linux-bin
phpenv-git
proton-authenticator-bin
proton-mail-bin
proton-pass-bin
proton-pass-cli-bin
pwvucontrol
python-imageio-ffmpeg
python-screeninfo
redhat-fonts
rig
sddm-silent-theme
sddm-sugar-candy-git
slack-desktop
spotify
ttf-martian-grotesk-variable
yay
yay-debug
