tap "adoptopenjdk/openjdk"
tap "d12frosted/emacs-plus"
tap "filosottile/musl-cross", "https://github.com/FiloSottile/homebrew-musl-cross"
tap "homebrew/cask"
tap "homebrew/core"
tap "jeffreywildman/virt-manager"
tap "jesseduffield/lazydocker"
tap "joshmedeski/sesh"
tap "libsql/sqld"
tap "neovim/neovim"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "rbenv/tap"
tap "rfidresearchgroup/proxmark3"
tap "romkatv/powerlevel10k"
tap "sergiobenitez/osxct", "https://github.com/SergioBenitez/homebrew-osxct"
tap "shivammathur/php"
tap "stripe/stripe-cli"
tap "symfony-cli/tap"
tap "tursodatabase/tap"
tap "wpscanteam/tap"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Library for command-line editing
brew "readline"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# DuckDuckGo from the terminal
brew "ddgr"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Compression/decompression library aiming for high speed
brew "snappy"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Database of public exploits and corresponding vulnerable software
brew "exploitdb"
# Modern, maintained replacement for ls
brew "eza"
# Powerful, lightweight programming language
brew "lua"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast web fuzzer written in Go
brew "ffuf"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo", link: false
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Converts markdown into roff (man pages)
brew "go-md2man"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Apache HTTP server
brew "httpd"
# Configurable static site generator
brew "hugo"
# Network logon cracker which supports many services
brew "hydra"
# GNU utilities for networking
brew "inetutils"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Conversion library
brew "libiconv"
# VP8/VP9 video codec
brew "libvpx"
# YAML Parser
brew "libyaml"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Command-line Git information tool
brew "onefetch"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php@8.1"
# General-purpose scripting language
brew "php@8.2", restart_service: :changed
# General-purpose scripting language
brew "php@8.3", restart_service: :changed, link: true
# General-purpose scripting language (legacy projects)
brew "php@7.4"
# PHP Static Analysis Tool
brew "phpstan"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Hook preloader
brew "proxychains-ng"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Rust toolchain installer
brew "rustup"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Cross-shell prompt for astronauts
brew "starship"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Parser generator tool
brew "tree-sitter-cli"
# Watch files and take action when they change
brew "watchman"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Command-line interface for WordPress
brew "wp-cli"
# Bash completion for Wpcli
brew "wp-cli-completion"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Network scanner for Internet-wide network studies
brew "zmap"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Session manager for tmux
brew "sesh"
# SQL database for the edge
brew "sqld"
# Platform to manage, backup, and restore databases
brew "turso"
# RFID research tool
brew "proxmark3"
# Stripe CLI
brew "stripe"
# Symfony CLI
brew "symfony-cli"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web security testing toolkit
cask "burp-suite"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Launcher for *Epic Games* games
cask "epic-games"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-ipafont"
cask "font-m-plus-1"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# GPU-based terminal emulator
cask "kitty"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI coding agent desktop client
cask "opencode-desktop"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# MySQL/MariaDB database management
cask "sequel-ace"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Web browser focusing on security
cask "tor-browser"
# Virtualiser for x86 hardware
cask "virtualbox"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/goreleaser/goreleaser/v2"
cargo "cargo-leptos"
cargo "cross"
cargo "speedtest-rs"
cargo "tokei"
cargo "trunk"
npm "corepack"
