tap "adoptopenjdk/openjdk"
tap "exolnet/deprecated"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kevwil/patches"
tap "neovim/neovim"
tap "nickolasburr/pfa"
tap "romkatv/powerlevel10k"
tap "wpscanteam/tap"
brew "ack"
brew "aircrack-ng"
brew "jpeg"
brew "autoconf"
brew "automake"
brew "bash"
brew "icu4c"
brew "node"
brew "bower"
brew "python@3.9"
brew "pkg-config"
brew "coreutils"
brew "libtool"
brew "cask"
brew "cmake"
brew "cmatrix"
brew "curl"
brew "pcre2"
brew "php", link: false
brew "composer"
brew "ctags"
brew "dnsmasq", restart_service: true
brew "docker-compose"
brew "elinks"
brew "exiftool"
brew "exploitdb"
brew "snappy"
brew "gobject-introspection"
brew "harfbuzz"
brew "libvpx"
brew "ffmpeg"
brew "fswatch"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-standup"
brew "gnu-getopt"
brew "libksba"
brew "gnupg"
brew "gobuster"
brew "grunt-cli"
brew "gulp-cli"
brew "hashcat"
brew "htop"
brew "httpd"
brew "hydra"
brew "inetutils"
brew "john-jumbo"
brew "libiconv"
brew "libyaml"
brew "lnav"
brew "mysql"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nikto"
brew "nmap"
brew "nvm"
brew "onefetch"
brew "openjdk"
brew "pandoc"
brew "perl"
brew "php-cs-fixer"
brew "php@7.2", restart_service: true
brew "php@7.3"
brew "php@7.4"
brew "php@8.0", link: true
brew "phplint"
brew "phpmd"
brew "phpstan"
brew "pinentry-mac"
brew "proxychains-ng"
brew "qt"
brew "sqlmap"
brew "tmate"
brew "tmux"
brew "tor"
brew "watchman"
brew "wget"
brew "wp-cli"
brew "wp-cli-completion"
brew "yarn"
brew "youtube-dl"
brew "zsh"
cask "adoptopenjdk12"
cask "burp-suite"
cask "cyberduck"
cask "docker"
cask "epic-games"
cask "font-hack-nerd-font"
cask "insomnia"
cask "iterm2"
cask "logitech-g-hub"
cask "metasploit"
cask "mono-mdk-for-visual-studio"
cask "obs"
cask "openoffice"
cask "openvpn-connect"
cask "raspberry-pi-imager"
cask "sequel-ace"
cask "telegram"
cask "tor-browser"
cask "visual-studio"
cask "visual-studio-code"
cask "wireshark"
