tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kevwil/patches"
tap "neovim/neovim"
tap "nickolasburr/pfa"
tap "romkatv/powerlevel10k"
tap "shivammathur/php"
tap "stripe/stripe-cli"
tap "wpscanteam/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for command-line editing
brew "readline"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Platform built on V8 to build network applications
brew "node"
# Package manager for the web
brew "bower"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Compression/decompression library aiming for high speed
brew "snappy"
# Text mode web browser
brew "elinks"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Database of public exploits and corresponding vulnerable software
brew "exploitdb"
# OpenType text shaping engine
brew "harfbuzz"
# Image manipulation library
brew "jpeg", link: true
# VP8/VP9 video codec
brew "libvpx"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Git extension to generate reports for standup meetings
brew "git-standup"
# Command-line option parsing utility
brew "gnu-getopt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# JavaScript Task Runner
brew "grunt-cli"
# Command-line utility for Gulp
brew "gulp-cli"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Open source relational database management system
brew "mysql-client"
# Network logon cracker which supports many services
brew "hydra"
# GNU utilities for networking
brew "inetutils"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Conversion library
brew "libiconv"
# YAML Parser
brew "libyaml"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# General-purpose scripting language
brew "php@8.0", restart_service: true, link: true
# PHP Mess Detector
brew "phpmd"
# PHP Static Analysis Tool
brew "phpstan"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Hook preloader
brew "proxychains-ng"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform application and UI framework
brew "qt"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Watch files and take action when they change
brew "watchman"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Command-line interface for WordPress
brew "wp-cli"
# Bash completion for Wpcli
brew "wp-cli-completion"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Network scanner for Internet-wide network studies
brew "zmap"
# UNIX shell (command interpreter)
brew "zsh"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Manage team projects and tasks
cask "asana"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web security testing toolkit
cask "burp-suite"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Office suite
cask "libreoffice"
# Penetration testing framework
cask "metasploit"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# VPN client focusing on security
cask "protonvpn"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# MySQL/MariaDB database management
cask "sequel-ace"
# Instant messaging application focusing on security
cask "signal"
# Web browser focusing on security
cask "tor-browser"
# Virtualizer for x86 hardware
cask "virtualbox"
# Remote desktop application focusing on security
cask "vnc-viewer"
